app/views/cart/index.html.erb

<% @cart.each do | id, quantity | %>
    <% bike = Bike.find_by_id(id) %>
---
SELECT  "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT 1  [["id", 1]]