app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes" WHERE (Bike Title = 'Mountain Bike')  ORDER BY created_at ASC
---
  def index
    @bikes = Bike.all

INSERT INTO "bikes" ("title", "description", "image_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", ""], ["description", ""], ["image_url", ""], ["created_at", "2016-08-25 18:59:37.821227"], ["updated_at", "2016-08-25 18:59:37.821227"]]
---
  def create
    @bike = Bike.new(bike_params)

    respond_to do |format|
      if @bike.save

UPDATE "bikes" SET "image_url" = ?, "updated_at" = ? WHERE "bikes"."id" = ?  [["image_url", "product1.jpg"], ["updated_at", "2016-08-25 12:48:05.927933"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @bike.update(bike_params)

DELETE FROM "bikes" WHERE "bikes"."id" = ?  [["id", 1]]
---
  def destroy
    @bike.destroy

SELECT  "bikes".* FROM "bikes" WHERE "bikes"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_bike
      @bike = Bike.find(params[:id])