app/controllers/user_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users" WHERE (email = 'email2@email.com')  ORDER BY created_at ASC